{
  "siapa yang buat web ini?": "Yang membuat web ini adalah Yoralph.",
  "apa tujuan web ini?": "Tujuan web ini adalah untuk menampilkan informasi tentang proyek Yoralph.",
  "siapa kamu?": "Aku adalah Yora, chatbot yang dibuat oleh Yoralph.",
  "hai": "Hai! Aku adalah Yora, chatbot yang dibuat oleh Yoralph.",
  "halo bro": "haloo broooo, aku adalah Yora.",
  "halo": "Halo! Aku adalah Yora.",
  "siapa Yoralph?": "Yoralph adalah nama alias dari Alphareno Yanuar Syaputra, seorang mahasiswa D3 Teknologi Informasi di Universitas Brawijaya.",
  "dimana Yoralph kuliah?": "Yoralph kuliah di Universitas Brawijaya, Fakultas Vokasi, jurusan D3 Teknologi Informasi.",
  "apa minat Yoralph?": "Yoralph memiliki minat dalam teknologi informasi, pengembangan sistem, dan solusi teknologi untuk meningkatkan efisiensi dan produktivitas.",
  "apa cita-cita Yoralph?": "Yoralph bercita-cita membantu orang lebih memahami dan memanfaatkan teknologi dalam kehidupan sehari-hari.",
  "apa proyek yang sedang dikerjakan Yoralph?": "Yoralph sedang mengerjakan proyek chatbot AI serta pengembangan website portfolio.",
  "apa itu Yora?": "Yora adalah chatbot AI yang dibuat oleh Yoralph untuk menjawab pertanyaan pengguna.",
  "apakah Yora bisa belajar?": "Saat ini, Yora masih berbasis data statis, tetapi ke depannya bisa dikembangkan menjadi chatbot yang lebih pintar.",
  "apa hobi Yoralph?": "Yoralph suka coding, eksplorasi teknologi baru, dan mendengarkan musik dari Bernadya.",
  "siapa penyanyi favorit Yoralph?": "Penyanyi favorit Yoralph adalah Bernadya dari Indonesia.",
  "apa perangkat yang digunakan Yoralph?": "Yoralph menggunakan laptop HP EliteBook 830 G5 dengan AMD Athlon Silver 3050U, RAM 12GB, dan sistem operasi Windows 11.",
  "apakah Yoralph bisa membuat bahasa pemrograman sendiri?": "Yoralph tertarik dengan sejarah PHP dan ingin seperti penciptanya, jadi mungkin suatu saat dia bisa membuat bahasa pemrogramannya sendiri.",
  "apakah Yoralph bisa coding?": "Ya! Yoralph bisa coding dan sedang mengembangkan berbagai proyek berbasis web dan AI.",
  "apa yang sedang dipelajari Yoralph?": "Yoralph sedang belajar algoritma dan pemrograman menggunakan bahasa Java, serta memperdalam pemahaman tentang Laravel dan pengembangan AI.",
  "apa tema final project Yoralph?": "Yoralph masih mencari tema besar untuk final project-nya, tetapi kemungkinan berkaitan dengan AI atau efisiensi sistem.",
  "apakah Yoralph punya server Discord?": "Ya, Yoralph sedang membangun server Discord untuk teman-temannya, tempat belajar, sharing info, dan hiburan.",
  "bagaimana cara berkontribusi ke proyek Yoralph?": "Kamu bisa menghubungi Yoralph melalui kontak yang tersedia di website untuk berdiskusi tentang kontribusi pada proyeknya.",
  "apa keahlian Yoralph?": "Yoralph memiliki keahlian di bidang coding, pengembangan sistem, dan pemecahan masalah berbasis teknologi.",
  "dimana Yoralph tinggal?": "Yoralph tinggal di Lumajang, Jawa Timur, kota yang terkenal dengan pisangnya dan keindahan alamnya.",
  "berapa umur Yoralph?": "Yoralph berusia 19 tahun.",
  "apa makanan favorit Yoralph?": "Makanan favorit Yoralph belum diketahui secara pasti, tapi dia tinggal di Lumajang, yang terkenal dengan pisang dan kuliner khas Jawa Timur.",
  "apa warna favorit Yoralph?": "Warna favorit Yoralph belum diketahui, tapi kamu bisa menanyakannya langsung ke dia!",
  "apa lagu favorit Yoralph?": "Yoralph suka mendengarkan lagu-lagu dari Bernadya.",
  "apa framework favorit Yoralph?": "Saat ini, Yoralph sedang mempelajari Laravel untuk pengembangan web.",
  "apakah Yoralph suka bermain game?": "Ya, Yoralph punya tempat khusus di server Discord-nya untuk bermain game bareng teman-temannya.",
  "apa saja skill yang sedang dikembangkan Yoralph?": "Yoralph sedang mengembangkan skill di bidang AI, machine learning, dan pengembangan web.",
  "apakah Yoralph pernah ikut lomba?": "Informasi ini belum tersedia, tapi mungkin Yoralph pernah ikut lomba di bidang IT atau teknologi.",
  "apa tantangan terbesar Yoralph saat ini?": "Tantangan terbesar Yoralph saat ini adalah menyelesaikan final project dan mengembangkan AI yang lebih cerdas.",
  "apa rencana jangka panjang Yoralph?": "Rencana jangka panjang Yoralph adalah menciptakan sistem berbasis AI yang bisa membantu banyak orang dalam kehidupan sehari-hari.",
  "apakah Yoralph punya website pribadi?": "Saat ini, Yoralph sedang mengembangkan website portfolio pribadinya.",
  "bagaimana cara menghubungi Yoralph?": "Kamu bisa menghubungi Yoralph melalui media sosial atau kontak yang tersedia di websitenya.",
  "apakah Yoralph suka belajar hal baru?": "Tentu! Yoralph selalu tertarik untuk mempelajari teknologi baru dan meningkatkan kemampuannya di bidang IT.",
  "apakah Yoralph bisa membuat aplikasi mobile?": "Saat ini, Yoralph lebih fokus pada pengembangan website dan AI, tetapi mungkin di masa depan dia akan belajar pengembangan aplikasi mobile.",
  "apakah Yoralph bisa desain UI/UX?": "Yoralph memiliki pemahaman dasar tentang UI/UX dan sedang meningkatkan keterampilannya untuk membuat tampilan yang lebih menarik.",
  "apa bahasa pemrograman favorit Yoralph?": "Yoralph saat ini sering menggunakan Java dan PHP dalam proyeknya, tetapi dia juga tertarik dengan Python untuk AI.",
  "apakah Yoralph pernah membuat game?": "Belum ada informasi apakah Yoralph pernah membuat game, tetapi dia tertarik dengan pengembangan AI yang bisa diterapkan dalam game.",
  "bagaimana cara belajar programming seperti Yoralph?": "Yoralph belajar programming dengan banyak praktik, mengikuti tutorial, membaca dokumentasi, dan mengerjakan proyek sendiri.",
  "apakah Yoralph suka open source?": "Ya! Yoralph tertarik dengan konsep open source dan ingin berkontribusi pada proyek open source di masa depan.",
  "apa pendapat Yoralph tentang AI?": "Yoralph percaya bahwa AI adalah teknologi masa depan yang bisa membantu manusia dalam banyak aspek kehidupan.",
  "apakah Yoralph punya channel YouTube?": "Belum ada informasi tentang channel YouTube Yoralph, tetapi mungkin dia akan membuatnya di masa depan untuk berbagi ilmu teknologi.",
  "apakah Yoralph aktif di media sosial?": "Yoralph menggunakan media sosial untuk belajar dan berbagi informasi, tetapi seberapa aktifnya masih belum diketahui.",
  "apa cita-cita terbesar Yoralph?": "Yoralph ingin menciptakan teknologi yang bisa membantu banyak orang dan berkontribusi dalam perkembangan AI.",
  "apakah Yoralph pernah mengalami kegagalan?": "Seperti semua orang yang belajar, Yoralph pasti pernah mengalami kegagalan, tetapi dia terus belajar dari kesalahan dan berkembang.",
  "apakah Yoralph suka tantangan?": "Ya! Yoralph suka tantangan, terutama dalam dunia teknologi dan pemrograman.",
  "apa rekomendasi laptop dari Yoralph untuk coding?": "Yoralph menggunakan HP EliteBook 830 G5 dengan RAM 12GB, tetapi rekomendasi laptop tergantung pada kebutuhan dan budget masing-masing.",
  "apa framework frontend favorit Yoralph?": "Saat ini, belum ada informasi pasti tentang framework frontend favorit Yoralph, tetapi dia mungkin menggunakan React atau Vue.js di masa depan.",
  "apakah Yoralph bisa membuat AI yang bisa berbicara?": "Saat ini, Yoralph sedang belajar tentang AI, jadi mungkin suatu hari nanti dia bisa membuat AI yang bisa berbicara.",
  "apa yang membuat Yoralph tertarik dengan teknologi?": "Yoralph tertarik dengan teknologi karena dia melihat bagaimana teknologi bisa membantu dan memudahkan kehidupan manusia.",
  "apakah Yoralph punya mentor?": "Yoralph belajar dari banyak sumber, termasuk tutorial online, dokumentasi resmi, dan komunitas pemrograman.",
  "bagaimana cara Yoralph mengatasi error saat coding?": "Yoralph biasanya membaca error message, mencari solusi di internet, dan melakukan debugging untuk menemukan kesalahan dalam kode.",
  "apa yang sedang dikerjakan Yoralph saat ini?": "Yoralph sedang mengembangkan chatbot AI dan website portfolio pribadinya.",
  "apakah Yoralph suka bekerja dalam tim?": "Yoralph bisa bekerja sendiri maupun dalam tim, tergantung pada proyek yang sedang dikerjakan.",
  "apa tools favorit Yoralph untuk coding?": "Yoralph menggunakan berbagai tools seperti VS Code, NetBeans, dan terminal untuk coding.",
  "apa langkah pertama untuk belajar AI menurut Yoralph?": "Menurut Yoralph, langkah pertama untuk belajar AI adalah memahami dasar-dasar pemrograman dan algoritma, lalu belajar tentang machine learning dan deep learning.",
  "apakah Yoralph punya pengalaman freelance?": "Belum ada informasi apakah Yoralph pernah bekerja freelance, tetapi mungkin dia tertarik mencoba di masa depan.",
  "bagaimana cara menjadi programmer yang lebih baik menurut Yoralph?": "Menurut Yoralph, cara terbaik untuk menjadi programmer yang lebih baik adalah dengan terus berlatih, membaca dokumentasi, dan membangun proyek nyata.",
  "apa teknologi masa depan yang menarik bagi Yoralph?": "Yoralph tertarik dengan AI, blockchain, dan teknologi otomatisasi yang bisa meningkatkan efisiensi berbagai industri.",
  "apakah Yoralph tertarik dengan cybersecurity?": "Ya, Yoralph menyadari pentingnya keamanan siber dan mungkin akan mempelajarinya lebih dalam di masa depan.",
  "bagaimana cara Yoralph mengatur waktu antara kuliah dan coding?": "Yoralph mengatur waktu dengan membuat jadwal dan fokus pada prioritasnya, seperti tugas kuliah dan proyek coding.",
  "apakah Yoralph suka mengikuti hackathon?": "Belum ada informasi apakah Yoralph pernah mengikuti hackathon, tetapi sebagai seseorang yang suka tantangan, dia mungkin akan tertarik mencoba.",
  "apa yang memotivasi Yoralph untuk terus belajar?": "Yoralph termotivasi oleh keinginannya untuk menciptakan solusi teknologi yang bermanfaat bagi banyak orang."
}
